Ran Plan for 5 projects:

1. project: `SPA-rdot-helia` dir: `SPA/SPA-rdot/env/helia` workspace: `default`
1. project: `SPA-rdot-production` dir: `SPA/SPA-rdot/env/production` workspace: `default`
1. project: `SPA-rdot-staging` dir: `SPA/SPA-rdot/env/staging` workspace: `default`
1. project: `application-adot-production` dir: `applications/application-adot/env/production` workspace: `default`
1. project: `application-adot-staging` dir: `applications/application-adot/env/staging` workspace: `default`
---

### 1. project: `SPA-rdot-helia` dir: `SPA/SPA-rdot/env/helia` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'echo "Using existing AWS credentials for helia environment"
cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl
terraform init -backend-config="env/helia/helia.conf" -reconfigure -lock=false -input=false
terraform plan -compact-warnings -var-file="config/helia.tfvars" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/SPA/SPA-rdot/env/helia': exit status 1: running "echo \"Using existing AWS credentials for helia environment\"\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\nterraform init -backend-config=\"env/helia/helia.conf\" -reconfigure -lock=false -input=false\nterraform plan -compact-warnings -var-file=\"config/helia.tfvars\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/SPA/SPA-rdot/env/helia": 
Using existing AWS credentials for helia environment
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.35.0...
- Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
module.my_bucket.aws_s3_bucket.this: Refreshing state... [id=network-helia-bucket11756]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0b5863d41f167221b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.my_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "network-helia-bucket11756"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "helia"
        }
      + tags_all                    = {
          + "Environment" = "helia"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Missing required argument
│ 
│   with provider["registry.terraform.io/hashicorp/aws"],
│   on providers.tf line 1, in provider "aws":
│    1: provider "aws" {
│ 
│ The argument "role_arn" is required, but no definition was found.
│ 
│ This will be an error in a future release of the provider.
╵
╷
│ Error: reading EC2 VPC (vpc-0b5863d41f167221b): operation error EC2: DescribeVpcs, https response error StatusCode: 403, RequestID: 85ebb192-7d8f-402b-80b9-15a1e49603bb, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::569023477847:assumed-role/atlantis-task-role/d7168d93b2bb4622bf42ccca8cae4985 is not authorized to perform: ec2:DescribeVpcs because no identity-based policy allows the ec2:DescribeVpcs action
│ 
│   with module.vpc.aws_vpc.this,
│   on modules/vpc/main.tf line 1, in resource "aws_vpc" "this":
│    1: resource "aws_vpc" "this" {
│ 
╵


```
</details>

---
### 2. project: `SPA-rdot-production` dir: `SPA/SPA-rdot/env/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod for production environment
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.35.0...
- Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-009237435e416bef7]
module.my_bucket.aws_s3_bucket.this: Refreshing state... [id=network-prod-bucket71113]
module.vpc.aws_subnet.private_subnets[1]: Refreshing state... [id=subnet-02835092eb3cd1197]
module.vpc.aws_subnet.private_subnets[0]: Refreshing state... [id=subnet-05c1790562d39a517]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_vpc.this has been deleted
-   resource "aws_vpc" "this" {
-       id                                   = "vpc-009237435e416bef7" -> null
        tags                                 = {
            "Environment" = "production"
            "Name"        = "prod-atlantis-vpc"
        }
        # (20 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/SPA/SPA-rdot/env/production/SPA-rdot-production-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/SPA/SPA-rdot/env/production/SPA-rdot-production-default.tfplan"
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 3. project: `SPA-rdot-staging` dir: `SPA/SPA-rdot/env/staging` workspace: `default`
<details><summary>Show Output</summary>

```diff
Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.35.0...
- Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0ceddfcc480870477]
module.my_bucket.aws_s3_bucket.this: Refreshing state... [id=network-stage-bucket3345]
module.vpc.aws_subnet.private_subnets[0]: Refreshing state... [id=subnet-0bdefd51c0e566f40]
module.vpc.aws_subnet.private_subnets[1]: Refreshing state... [id=subnet-04b91a8302d3bff2e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_vpc.this has been deleted
-   resource "aws_vpc" "this" {
-       id                                   = "vpc-0ceddfcc480870477" -> null
        tags                                 = {
            "Environment" = "staging"
            "Name"        = "stage-atlantis-vpc"
        }
        # (20 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-vpc"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/SPA/SPA-rdot/env/staging/SPA-rdot-staging-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/SPA/SPA-rdot/env/staging/SPA-rdot-staging-default.tfplan"
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 4. project: `application-adot-production` dir: `applications/application-adot/env/production` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'echo "Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod for production environment"
cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl

terraform init -backend-config="env/production/prod.conf" -reconfigure -lock=false -input=false

terraform plan -compact-warnings -var-file="config/production.tfvars" -var="assume_role_arn=arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/applications/application-adot/env/production': exit status 1: running "echo \"Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod for production environment\"\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\n\nterraform init -backend-config=\"env/production/prod.conf\" -reconfigure -lock=false -input=false\n\nterraform plan -compact-warnings -var-file=\"config/production.tfvars\" -var=\"assume_role_arn=arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/applications/application-adot/env/production": 
Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod for production environment
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.35.0...
- Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
╷
│ Error: Reference to undeclared input variable
│ 
│   on providers.tf line 9, in provider "aws":
│    9:       environment = var.base.environment
│ 
│ An input variable with the name "base" has not been declared. This variable
│ can be declared with a variable "base" {} block.
╵
╷
│ Error: Reference to undeclared input variable
│ 
│   on providers.tf line 10, in provider "aws":
│   10:       project     = var.base.project
│ 
│ An input variable with the name "base" has not been declared. This variable
│ can be declared with a variable "base" {} block.
╵


```
</details>

---
### 5. project: `application-adot-staging` dir: `applications/application-adot/env/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'echo "Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment"
cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl

terraform init -backend-config="env/staging/stage.conf" -reconfigure -lock=false -input=false

terraform plan -compact-warnings -var-file="config/stage.tfvars" -var="assume_role_arn=arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/applications/application-adot/env/staging': exit status 1: running "echo \"Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment\"\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\n\nterraform init -backend-config=\"env/staging/stage.conf\" -reconfigure -lock=false -input=false\n\nterraform plan -compact-warnings -var-file=\"config/stage.tfvars\" -var=\"assume_role_arn=arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/34/default/applications/application-adot/env/staging": 
Using assume role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.35.0...
- Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
╷
│ Error: Reference to undeclared input variable
│ 
│   on providers.tf line 9, in provider "aws":
│    9:       environment = var.base.environment
│ 
│ An input variable with the name "base" has not been declared. This variable
│ can be declared with a variable "base" {} block.
╵
╷
│ Error: Reference to undeclared input variable
│ 
│   on providers.tf line 10, in provider "aws":
│   10:       project     = var.base.project
│ 
│ An input variable with the name "base" has not been declared. This variable
│ can be declared with a variable "base" {} block.
╵


```
</details>

---
### Plan Summary

5 projects, 2 with changes, 0 with no changes, 3 failed